In [374]:
import pandas as pd 
import numpy as np

In [375]:
data= pd.Series([1, 3, 5, np.nan, 6, 8])
data

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [376]:
pd.Series([1, 3, 5, np.nan, 6, 8],index=list("abcdef"))

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64

In [377]:
dates=pd.date_range(start="01-01-2000",end="13-01-2000",periods=6)
dates

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-03 09:36:00',
               '2000-01-05 19:12:00', '2000-01-08 04:48:00',
               '2000-01-10 14:24:00', '2000-01-13 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [378]:
date_data=pd.DataFrame(np.random.randint(10,50,16).reshape(4,4),index=pd.date_range(start="01-01-2025",end="13-01-2025",periods=4),columns=list("ABCD"))
date_data

             A   B   C   D
2025-01-01  14  30  28  31
2025-01-05  44  38  41  30
2025-01-09  30  21  42  22
2025-01-13  26  11  26  16

In [379]:
date_data["C"]

2025-01-01    28
2025-01-05    41
2025-01-09    42
2025-01-13    26
Name: C, dtype: int32

In [380]:
date_data[["A","B"]]

             A   B
2025-01-01  14  30
2025-01-05  44  38
2025-01-09  30  21
2025-01-13  26  11

In [381]:
date_data.loc["2025-01-01"]

A    14
B    30
C    28
D    31
Name: 2025-01-01 00:00:00, dtype: int32

In [382]:
date_data.iloc[0]

A    14
B    30
C    28
D    31
Name: 2025-01-01 00:00:00, dtype: int32

In [383]:
date_data.iloc[0:3]

             A   B   C   D
2025-01-01  14  30  28  31
2025-01-05  44  38  41  30
2025-01-09  30  21  42  22

In [384]:
date_data.iloc[0:3,0:2]       #[satır:satır,sütun:sütun]

             A   B
2025-01-01  14  30
2025-01-05  44  38
2025-01-09  30  21

In [385]:
date_data["new_column"]=11
date_data

             A   B   C   D  new_column
2025-01-01  14  30  28  31          11
2025-01-05  44  38  41  30          11
2025-01-09  30  21  42  22          11
2025-01-13  26  11  26  16          11

In [386]:
date_data.drop("new_column",axis=1)   #inplace true yapmazsak date_data da hala new_column var olmaya devam eder

             A   B   C   D
2025-01-01  14  30  28  31
2025-01-05  44  38  41  30
2025-01-09  30  21  42  22
2025-01-13  26  11  26  16

In [387]:
date_data.drop("2025-01-01",axis=0,inplace=True) #2. kez calistirirsak hata aliriz cünkü verilen satir yok

In [388]:
date_data

             A   B   C   D  new_column
2025-01-05  44  38  41  30          11
2025-01-09  30  21  42  22          11
2025-01-13  26  11  26  16          11

In [389]:
new_row=pd.DataFrame([[25, 35, 45, 20,11]],columns=["A", "B", "C", "D","new_column"],index=["2025-01-01"])
date_data=pd.concat([date_data, new_row])
date_data

                      A   B   C   D  new_column
2025-01-05 00:00:00  44  38  41  30          11
2025-01-09 00:00:00  30  21  42  22          11
2025-01-13 00:00:00  26  11  26  16          11
2025-01-01           25  35  45  20          11

In [390]:
date_data[date_data["B"]>13]

                      A   B   C   D  new_column
2025-01-05 00:00:00  44  38  41  30          11
2025-01-09 00:00:00  30  21  42  22          11
2025-01-01           25  35  45  20          11

In [391]:
date_data.reset_index()

                 index   A   B   C   D  new_column
0  2025-01-05 00:00:00  44  38  41  30          11
1  2025-01-09 00:00:00  30  21  42  22          11
2  2025-01-13 00:00:00  26  11  26  16          11
3           2025-01-01  25  35  45  20          11

In [392]:
date_data

                      A   B   C   D  new_column
2025-01-05 00:00:00  44  38  41  30          11
2025-01-09 00:00:00  30  21  42  22          11
2025-01-13 00:00:00  26  11  26  16          11
2025-01-01           25  35  45  20          11

In [393]:
datas=np.random.random(24).reshape(6,4)
new_df=pd.DataFrame(data=datas,index=["Furkan","Can","Sevim","Umay","Gökçe","Almila"],columns=["Salary","performance","prim","mesai"])
new_df

          Salary  performance      prim     mesai
Furkan  0.729403     0.481845  0.433026  0.314582
Can     0.445874     0.452143  0.592867  0.265525
Sevim   0.797608     0.929812  0.433139  0.850683
Umay    0.635382     0.596884  0.120600  0.846510
Gökçe   0.618414     0.163436  0.362740  0.414434
Almila  0.743597     0.503880  0.997048  0.962978

In [394]:
gruplar=["Yönetim","Yönetim","Yönetim","Calisan","Calisan","Calisan"]
new_df.index=pd.MultiIndex.from_arrays([gruplar,new_df.index],names=["görev","isim"])
new_df

                  Salary  performance      prim     mesai
görev   isim
Yönetim Furkan  0.729403     0.481845  0.433026  0.314582
        Can     0.445874     0.452143  0.592867  0.265525
        Sevim   0.797608     0.929812  0.433139  0.850683
Calisan Umay    0.635382     0.596884  0.120600  0.846510
        Gökçe   0.618414     0.163436  0.362740  0.414434
        Almila  0.743597     0.503880  0.997048  0.962978

In [395]:
new_df.index = new_df.index.droplevel("görev")
new_df

          Salary  performance      prim     mesai
isim
Furkan  0.729403     0.481845  0.433026  0.314582
Can     0.445874     0.452143  0.592867  0.265525
Sevim   0.797608     0.929812  0.433139  0.850683
Umay    0.635382     0.596884  0.120600  0.846510
Gökçe   0.618414     0.163436  0.362740  0.414434
Almila  0.743597     0.503880  0.997048  0.962978

In [396]:
outer_index=["Yönetim","Yönetim","Yönetim","Calisan","Calisan","Calisan"]
first_index=["Furkan","Can","Sevim","Umay","Gökçe","Almila"]
zipped_index=list(zip(outer_index,first_index))
zipped_index=pd.MultiIndex.from_tuples(zipped_index)
new_df=pd.DataFrame(data=datas,index=zipped_index,columns=["Salary","performance","prim","mesai"])
new_df

                  Salary  performance      prim     mesai
Yönetim Furkan  0.729403     0.481845  0.433026  0.314582
        Can     0.445874     0.452143  0.592867  0.265525
        Sevim   0.797608     0.929812  0.433139  0.850683
Calisan Umay    0.635382     0.596884  0.120600  0.846510
        Gökçe   0.618414     0.163436  0.362740  0.414434
        Almila  0.743597     0.503880  0.997048  0.962978

In [ ]:
new_df.loc["Yönetim"]   #df[yönetim] calısmıyor cünkü MultiIndex kullanıldığında "Yönetim" bir sütun değil, bir index seviyesinin değeridir.
                        #df[yönetim] sütun arar

          Salary  performance      prim     mesai
Furkan  0.729403     0.481845  0.433026  0.314582
Can     0.445874     0.452143  0.592867  0.265525
Sevim   0.797608     0.929812  0.433139  0.850683

In [403]:
new_df.loc["Yönetim"]["prim"]

Furkan    0.433026
Can       0.592867
Sevim     0.433139
Name: prim, dtype: float64

In [404]:
new_df.loc[("Yönetim","Furkan")]

Salary         0.729403
performance    0.481845
prim           0.433026
mesai          0.314582
Name: (Yönetim, Furkan), dtype: float64

In [406]:
employee=pd.read_csv("6-employee.csv")
employee.head(5)

  Department Employee  Salary  Experience           City
0  Marketing    Emp_1   53483           1       New York
1      Sales    Emp_2   78555           8         Austin
2    Finance    Emp_3   47159           3         Austin
3      Sales    Emp_4  110077           3  San Francisco
4      Sales    Emp_5   65920           1       New York